Revit 2026 API
UIControlledApplication Class
Represents the Autodesk Revit user interface, providing access to UI customization methods and events.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIControlledApplication
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class UIControlledApplication
Public Class UIControlledApplication
public ref class UIControlledApplication
type UIControlledApplication = class end
The UIControlledApplication type exposes the following members.
Properties
Name | Description
ActiveAddInId
ControlledApplication | Returns the database level ControlledApplication represented by this UI-level ControlledApplication.
IsLateAddinLoading |  Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it is false, otherwise it should be true.
IsViewerModeActive |  Identifies if the current Revit session is running in Viewer mode
LoadedApplications
MainWindowHandle
ProductIsRS
Top
Methods
Name | Description
CreateAddInCommandBinding
CreateRibbonPanel(String)
CreateRibbonPanel(String, String)
CreateRibbonPanel(Tab, String)
CreateRibbonTab
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDockablePane
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRibbonPanels()
GetRibbonPanels(String)
GetRibbonPanels(Tab)
GetType | Gets the Type of the current instance.
(Inherited from Object)
LoadAddIn
LoadPackageContents
RegisterContextMenu
RegisterDockablePane
RemoveAddInCommandBinding
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Events
Name | Description
ApplicationClosing |  Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
DialogBoxShowing |  Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box.
DisplayingOptionsDialog |  Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
DockableFrameFocusChanged |  Subscribe to GenericDockableFrame activated event to be notified when Revit GenericDockableFrame is active or inactive.
DockableFrameVisibilityChanged |  Subscribe to GenericDockableFrame showing or hiding event to be notified when Revit GenericDockableFrame is showing or hiding.
FabricationPartBrowserChanged |  Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.
FormulaEditing |  Subscribe to the FormulaEditing event
Idling |  Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction.
SelectionChanged |  Subscribe to the SelectionChanged event to be notified after the selection was changed.
ThemeChanged |  Subscribe to the ThemeChanged event to be notified after the theme was changed.
TransferredProjectStandards |  Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog.
TransferringProjectStandards |  Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized.
ViewActivated |  Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document.
ViewActivating |  Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document.
Top
Remarks
This class does not provide access to documents because it is provided to you through the ExternalApplication OnStartup()/OnShutdown() methods, and those methods are when it is not possible to work with Revit documents. You can work with documents by getting them from the UIApplication class; that class is obtained from events and ExternalCommand callbacks.
See Also
Reference
Autodesk.Revit.UI Namespace